---
kind: property
id: P:Autodesk.Revit.DB.MEPCurveType.PreferredJunctionType
source: html/26a24a77-3bea-a5be-3d49-4b8f1bf1a06e.htm
---
# Autodesk.Revit.DB.MEPCurveType.PreferredJunctionType Property

The preferred junction type of the MEP curve type.

## Syntax (C#)
```csharp
public JunctionType PreferredJunctionType { get; set; }
```

## Remarks
Use RoutingPreferenceManager to set this property for PipeType MEPCurves.